# --- System & Utilities ---
cask "1password"              # Password manager
cask "bitwarden"              # Password manager
cask "adguard"                # Ad blocker
cask "alienator88-sentinel"   # Gatekeeper/Unquarantine
cask "backdrop"               # Desktop image
cask "apparency"              # Inspect application bundles
cask "bettertouchtool"        # Input customization & Automation
cask "deskpad"                # Desktop extender
cask "cleanmymac"             # Disk cleanup
cask "karabiner-elements"     # Keyboard customizer
cask "keka"                   # Archive manager
cask "keyboardcleantool"      # Keyboard/TouchBar lock
cask "macs-fan-control"       # Fan control
cask "name-mangler"           # Multi-file renaming
cask "neo-network-utility"    # Network diagnostics
cask "notchnook"              # Notch area customization
cask "popclip"                # Context-specific actions
cask "hhkb"                   # Config tool for HHKB
cask "raycast"                # Productivity launcher
cask "rectangle-pro"          # Window snapping
cask "suspicious-package"     # Installer inspection
cask "tailscale-app"          # Mesh VPN
cask "trex"                   # Text extraction

# --- Development Tools (GUI) ---
cask "ghostty"                # Terminal emulator (Native/GPU)
cask "wezterm@nightly"        # GPU terminal & multiplexer
cask "zed"                    # Multiplayer code editor
cask "ollama-app"             # Local AI model runner
cask "orbstack"               # Docker Desktop replacement
cask "container"              # Linux containers/VMs
cask "xcodes-app"             # Xcode version manager
cask "devtoys"                # Dev utility toolkit

# --- Design & Creative ---
cask "affinity"               # Image editing & Design
cask "blender"                # 3D creation suite
cask "drawio"                 # Diagram software
cask "handbrake-app"          # Video transcoder
cask "obs"                    # Streaming & Recording
cask "ogdesign-eagle"         # Reference image organizer
cask "shottr"                 # Screenshot measurement/annotation

# --- Productivity & Office ---
cask "antinote"               # Temporary notes & Calc
cask "coteditor"              # Plain-text editor
cask "craft"                  # Native document editor
cask "notion-calendar"        # Professional calendar
cask "scapple"                # Notepad/Mindmap
cask "scrivener"              # Typewriter-style word processor
cask "ia-presenter"           # Markdown based presentation tool
cask "ia-markdown-dictionary" # Markdown syntax dictionary for iA Writer
cask "soulver"                # Notepad with calculator
cask "macskk"                 # Japanese input method
cask "macwhisper"             # Transcription tool
cask "microsoft-word"         # Word processor
cask "microsoft-excel"        # Spreadsheet
cask "microsoft-powerpoint"   # Presentation
cask "microsoft-teams"        # Collaboration

# --- Web Browsers ---
cask "google-chrome"
cask "firefox"
cask "firefox@developer-edition" # Developer edition of Firefox
cask "microsoft-edge"
cask "vivaldi"                # A fast, privacy-focused browser
cask "duckduckgo"             # Privacy-focused
cask "tor-browser"            # Security-focused

# --- Communication & Others ---
cask "signal"                 # Secure messaging
cask "zoom"                   # Video meetings
cask "steam"                  # Game distribution
cask "crossover"              # Windows app emulation
cask "prismlauncher"          # Minecraft launcher
cask "downie"                 # Video downloader
cask "netnewswire"            # RSS reader
cask "google-drive"           # Google Drive
cask "burn"                   # CD burning

# --- Fonts ---
# Japanese Fonts
cask "font-aoboshi-one"
cask "font-biz-udpgothic"
cask "font-biz-udpmincho"
cask "font-genjyuugothic"
cask "font-genkigothic"
cask "font-gensekigothic"
cask "font-gensenrounded"
cask "font-genshingothic"
cask "font-hachi-maru-pop"
cask "font-hannari"
cask "font-harano-aji"
cask "font-hina-mincho"
cask "font-ipaexfont"
cask "font-ipafont"
cask "font-ipamjmincho"
cask "font-joti-one"
cask "font-just-another-hand"
cask "font-kaisei-decol"
cask "font-kaisei-harunoumi"
cask "font-kaisei-opti"
cask "font-kaisei-tokumin"
cask "font-kaiso"
cask "font-kiwi-maru"
cask "font-kokoro"
cask "font-kosugi"
cask "font-kosugi-maru"
cask "font-m-plus-1p"
cask "font-makinas4"
cask "font-mamelon"
cask "font-mochiy-pop-one"
cask "font-mochiy-pop-p-one"
cask "font-moralerspace"
cask "font-moralerspace-hw"
cask "font-moralerspace-jpdoc"
cask "font-nico-moji"
cask "font-noto-sans-jp"
cask "font-pigmo00"
cask "font-pigmo01"
cask "font-sawarabi-gothic"
cask "font-sawarabi-mincho"
cask "font-shippori-antique"
cask "font-shippori-antique-b1"
cask "font-shippori-mincho"
cask "font-shippori-mincho-b1"
cask "font-shizuru"
cask "font-shojumaru"
cask "font-sora"
cask "font-twinkle-star"
cask "font-yuji-boku"
cask "font-yuji-hentaigana-akari"
cask "font-yuji-hentaigana-akebono"
cask "font-yuji-syuku"
cask "font-yusei-magic"
cask "font-zen-old-mincho"

# Specialized Fonts
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-iceberg"
cask "font-poppins"
cask "font-poprumcute"
cask "font-simonetta"
cask "font-zed-mono-nerd-font"
