tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "charmbracelet/tap"
tap "cirruslabs/cli"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "r-lib/rig"
tap "tursodatabase/tap"
# Real-time data compression library
brew "lzo"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bash shell debugger
brew "bashdb"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Backend processor for BibLaTeX
brew "biber"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Next-gen compiler infrastructure
brew "llvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Language Server Protocol implementation for Crystal
brew "crystalline"
# Command-line csv viewer
brew "csvlens"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Cat alternative written in Go
brew "gat"
# R7RS Scheme implementation, developed to be a handy script interpreter
brew "gauche"
# GNU compiler collection
brew "gcc"
# GNOME text editor
brew "gedit"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Installer for the general purpose language Haskell
brew "ghcup"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU troff text-formatting system
brew "groff"
# File format designed to store large amounts of data
brew "hdf5"
# Post-modern modal text editor
brew "helix"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Selection-based modal text editor
brew "kakoune"
# LaTeX-to-HTML translator
brew "latex2html"
# Translate LaTeX to RTF
brew "latex2rtf"
# Compare and mark up LaTeX file differences
brew "latexdiff"
# Simple terminal UI for git commands
brew "lazygit"
# Common error values for all GnuPG components
brew "libgpg-error"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# SIXEL encoder/decoder implementation
brew "libsixel"
# LLVM Project Linker
brew "lld"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Mac App Store command-line interface
brew "mas"
# Terminal image, video, directory, and Markdown viewer
brew "mcat"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Mac command-line tool that automatically downloads macOS Firmwares / Installers
brew "mist-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Free/open-source library for nonlinear optimization
brew "nlopt"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Open source suite of directory software
brew "openldap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for the Pkl programming language
brew "pkl"
# PNG image optimizing utility
brew "pngquant"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Ruby language server
brew "solargraph"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift toolchain installer and manager
brew "swiftly"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Unidata unit conversion library
brew "udunits"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Web Assembly Binary Toolkit
brew "wabt"
# Standalone JIT-style runtime for WebAssembly, using Cranelift
brew "wasmtime"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Validate and execute GitHub Actions workflows locally
brew "wrkflw"
# X.Org Applications: xauth
brew "xauth"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
brew "tursodatabase/tap/turso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# VPN for privacy and security
cask "adguard-vpn"
# Note editor and whiteboard
cask "affine"
# Image editing and design software
cask "affinity"
# Configure Gatekeeper, unquarantine and self-sign apps
cask "alienator88-sentinel"
# Photo storage and sharing service
cask "amazon-photos"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Temporary notes with calculations and extensible features
cask "antinote"
# Inspect application bundles
cask "apparency"
# User-friendly GUI app for Homebrew
cask "applite"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Edit and manage bibliographies
cask "bibdesk"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# Client for the Box cloud storage service
cask "box-drive"
# CD burning application
cask "burn"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Code editor
cask "codeedit"
# Multi-language programming editor
cask "coderunner"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Tool to run Windows software
cask "crossover"
# Server and cloud storage browser
cask "cyberduck"
# AI-powered translator
cask "deepl"
# Virtual monitor for screen sharing
cask "deskpad"
# UI to create reproducible developer environments based on a devcontainer.json
cask "devpod"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Online diagram software
cask "drawio"
# Web browser focusing on privacy
cask "duckduckgo"
# Matrix collaboration client
cask "element"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Virtual workspace manager
cask "flashspace"
cask "font-aoboshi-one"
cask "font-biz-udpgothic"
cask "font-biz-udpmincho"
cask "font-genjyuugothic"
cask "font-genkigothic"
cask "font-gensekigothic"
cask "font-gensenrounded"
cask "font-genshingothic"
cask "font-hachi-maru-pop"
cask "font-hannari"
cask "font-harano-aji"
cask "font-hina-mincho"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-iceberg"
cask "font-ipaexfont"
cask "font-ipafont"
cask "font-ipamjmincho"
cask "font-joti-one"
cask "font-just-another-hand"
cask "font-kaisei-decol"
cask "font-kaisei-harunoumi"
cask "font-kaisei-opti"
cask "font-kaisei-tokumin"
cask "font-kaiso"
cask "font-kiwi-maru"
cask "font-kokoro"
cask "font-kosugi"
cask "font-kosugi-maru"
cask "font-m-plus-1p"
cask "font-makinas4"
cask "font-mamelon"
cask "font-mochiy-pop-one"
cask "font-mochiy-pop-p-one"
cask "font-moralerspace"
cask "font-moralerspace-hw"
cask "font-moralerspace-jpdoc"
cask "font-nico-moji"
cask "font-noto-sans-jp"
cask "font-pigmo00"
cask "font-pigmo01"
cask "font-poppins"
cask "font-poprumcute"
cask "font-sawarabi-gothic"
cask "font-sawarabi-mincho"
cask "font-shippori-antique"
cask "font-shippori-antique-b1"
cask "font-shippori-mincho"
cask "font-shippori-mincho-b1"
cask "font-shizuru"
cask "font-shojumaru"
cask "font-simonetta"
cask "font-sora"
cask "font-twinkle-star"
cask "font-yuji-boku"
cask "font-yuji-hentaigana-akari"
cask "font-yuji-hentaigana-akebono"
cask "font-yuji-syuku"
cask "font-yusei-magic"
cask "font-zed-mono-nerd-font"
cask "font-zen-old-mincho"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Extensible, firefox-based web browser
cask "glide-browser"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Genealogy software
cask "gramps"
# Open-source video transcoder
cask "handbrake-app"
# Allows keymap customization on HHKB HYBRID Type-S and HYBRID models
cask "hhkb"
# Markdown dictionary for Dictionary.app
cask "ia-markdown-dictionary"
# Create presentation slides from a Markdown document
cask "ia-presenter"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Find shortcuts for any installed application
cask "keyclu"
# Data visualization and analysis software
cask "labplot"
# Software for Logitech devices
cask "logi-options+"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# SKK Input Method
cask "macskk"
# Speech recognition tool
cask "macwhisper"
# Text editor
cask "mi"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source download manager
cask "motrix"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Multi-file renaming tool
cask "name-mangler"
# Network information and diagnostics utility
cask "neo-network-utility"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Organise all your reference images in one place
cask "ogdesign-eagle"
# Document editor
cask "onlyoffice"
# Replacement for Docker Desktop
cask "orbstack"
# Mimic the aesthetic of ray-oscilloscopes
cask "oscilloscope"
# Used to access context-specific actions when text is selected
cask "popclip"
# Minecraft launcher
cask "prismlauncher"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Data science software focusing on R and Python
cask "rstudio"
# Notepad software
cask "scapple"
# Word processing software with a typewriter style
cask "scrivener"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Notepad with a built-in calculator
cask "soulver"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Interior design application
cask "sweet-home3d"
# Quicklook extension for source files
cask "syntax-highlight"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Web browser focusing on security
cask "tor-browser"
# Easy to use text extraction tool
cask "trex"
# Virtual machines UI using QEMU
cask "utm"
# Virtualization tool
cask "virtualbuddy"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi@snapshot"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Baking Soda", id: 1601151613
mas "Bluebird", id: 1478757472
mas "Boop", id: 1518425043
mas "Codye", id: 1516894961
mas "Color Picker", id: 1545870783
mas "Compressor", id: 424390742
mas "Copilot", id: 6738511300
mas "DaisyDisk", id: 411643860
mas "Eagle for Safari", id: 1526651672
mas "egword Universal 2", id: 1272842196
mas "Expenses", id: 1492055171
mas "Final Cut Pro", id: 424389933
mas "FirstSeed Calendar", id: 1348617240
mas "FirstSeed Tasks", id: 1627018604
mas "Folder Quick Look", id: 6753110395
mas "Goodnotes", id: 1444383602
mas "HextEdit", id: 1557247094
mas "Hyperduck", id: 6444667067
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Locally", id: 6741426692
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Mercury", id: 1621800675
mas "Money Pro", id: 972572731
mas "Motion", id: 434290957
mas "NotesHub", id: 1621210753
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Orb", id: 6477840170
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "Patterns", id: 429449079
mas "Photomator", id: 1444636541
mas "Piccolo", id: 1561230039
mas "Pieoneer", id: 6739781207
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "QuickMIDI", id: 1459790045
mas "Raycast Companion", id: 6738274497
mas "RunCat", id: 1429033973
mas "ScreenToLayers", id: 1077317077
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "SnippetsLab", id: 1006087419
mas "stone", id: 1230288277
mas "Structured", id: 1499198946
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Usage", id: 1561788435
mas "Velja", id: 1607635845
mas "Vinegar", id: 1591303229
mas "Yata", id: 1631370175
mas "Yoink", id: 457622435
mas "ちゃちゃっとリネーマー", id: 6462363612
mas "辞書 by 物書堂", id: 1380563956
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "kilocode.kilo-code"
vscode "ms-vscode.hexeditor"
