tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "cirruslabs/cli"
tap "halqme/versions", "https://github.com/HALQME/homebrew-versions.git"
tap "humansignal/tap"
tap "libsql/sqld"
tap "modularml/packages"
tap "r-lib/rig"
tap "tk04/tap"
tap "tursodatabase/tap"
# Run your GitHub Actions locally
brew "act"
# Real-time data compression library
brew "lzo"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next-gen compiler infrastructure
brew "llvm"
# Download with resuming and segmented downloading
brew "aria2"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bash shell debugger
brew "bashdb"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Backend processor for BibLaTeX
brew "biber"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Freely available high-quality data compressor
brew "bzip2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Command-line csv viewer
brew "csvlens"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Cat alternative written in Go
brew "gat"
# R7RS Scheme implementation, developed to be a handy script interpreter
brew "gauche"
# GNU compiler collection
brew "gcc"
# Common error values for all GnuPG components
brew "libgpg-error"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Geospatial Data Abstraction Library
brew "gdal"
# GNOME text editor
brew "gedit"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Installer for the general purpose language Haskell
brew "ghcup"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU troff text-formatting system
brew "groff"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# LaTeX-to-HTML translator
brew "latex2html"
# Translate LaTeX to RTF
brew "latex2rtf"
# Compare and mark up LaTeX file differences
brew "latexdiff"
# Simple terminal UI for git commands
brew "lazygit"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# SIXEL encoder/decoder implementation
brew "libsixel"
# LLVM Project Linker
brew "lld"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Zero-dependency real-time media server and media proxy
brew "mediamtx"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Mac command-line tool that automatically downloads macOS Firmwares / Installers
brew "mist-cli"
# Cross platform, open source .NET development framework
brew "mono"
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Free/open-source library for nonlinear optimization
brew "nlopt"
# Open source suite of directory software
brew "openldap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for the Pkl programming language
brew "pkl"
# PNG image optimizing utility
brew "pngquant"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Ruby language server
brew "solargraph"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Version control system designed to be a better CVS
brew "subversion"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift toolchain installer and manager
brew "swiftly"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Programmatically correct mistyped console commands
brew "thefuck"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Markup-based typesetting system
brew "typst"
# Unidata unit conversion library
brew "udunits"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Standalone JIT-style runtime for WebAssembly, using Cranelift
brew "wasmtime"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# X.Org Applications: xauth
brew "xauth"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# Multi-type data labeling and annotation tool with standardized output format
brew "humansignal/tap/label-studio"
# Modular developer CLI tool
brew "modularml/packages/modular"
brew "tursodatabase/tap/turso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# VPN for privacy and security
cask "adguard-vpn"
# Note editor and whiteboard
cask "affine"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Configure Gatekeeper, unquarantine and self-sign apps
cask "alienator88-sentinel"
# Photo storage and sharing service
cask "amazon-photos"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Inspect application bundles
cask "apparency"
# Open-source project and knowledge management tool
cask "appflowy"
# User-friendly GUI app for Homebrew
cask "applite"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Edit and manage bibliographies
cask "bibdesk"
# Desktop password and login vault
cask "bitwarden"
# Virtual Audio Driver
cask "blackhole-2ch"
# 3D creation suite
cask "blender"
# Client for the Box cloud storage service
cask "box-drive"
# CD burning application
cask "burn"
# App to write and organise your ideas
cask "capacities"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Text and code editor
cask "chime"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Anthropic's official Claude AI desktop app
cask "claude"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Code editor
cask "codeedit"
# Multi-language programming editor
cask "coderunner"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Tool to run Windows software
cask "crossover"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# AI-powered translator
cask "deepl"
# Virtual monitor for screen sharing
cask "deskpad"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk@8"
# Online diagram software
cask "drawio"
# Web browser focusing on privacy
cask "duckduckgo"
# Matrix collaboration client
cask "element"
# Network scanner
cask "fing"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Virtual workspace manager
cask "flashspace"
# Hybrid IDE and text editor
cask "fleet"
cask "font-moralerspace"
cask "font-moralerspace-hw"
cask "font-moralerspace-hw-jpdoc"
cask "font-moralerspace-hw-nf"
cask "font-moralerspace-jpdoc"
cask "font-moralerspace-nf"
cask "font-plemol-jp-nf"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Genealogy software
cask "gramps"
# Open Source Multimedia Framework
cask "gstreamer-development"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Chat client for models on HuggingFace
cask "huggingchat"
# All-in-One Project Management Platform
cask "huly"
# Create presentation slides from a Markdown document
cask "ia-presenter"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Hex editor for reverse engineers
cask "imhex"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Find shortcuts for any installed application
cask "keyclu"
# Data visualization and analysis software
cask "labplot"
# Open source code editor written in Rust
cask "lapce"
# Discover, download, and run local LLMs
cask "lm-studio"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# SKK Input Method
cask "macskk"
# Speech recognition tool
cask "macwhisper"
# Text editor
cask "mi"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Sandbox construction video game
cask "minecraft"
# Educational version of Minecraft
cask "minecraft-education"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source download manager
cask "motrix"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Multi-file renaming tool
cask "name-mangler"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Automated scene switcher for OBS Studio
cask "obs-advanced-scene-switcher"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Organise all your reference images in one place
cask "ogdesign-eagle"
# Get up and running with large language models locally
cask "ollama-app"
# Interact with Ollama models
cask "ollamac"
# Cloud storage client
cask "onedrive"
# Document editor
cask "onlyoffice"
# Web browser
cask "opera-air"
# Replacement for Docker Desktop
cask "orbstack"
# Mimic the aesthetic of ray-oscilloscopes
cask "oscilloscope"
# Used to access context-specific actions when text is selected
cask "popclip"
# Sound, video and lighting control
cask "qlab"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# The R Installation Manager
cask "rig"
# Hardware-accelerated GPU terminal emulator
cask "rio"
# Data science software focusing on R and Python
cask "rstudio"
# Notepad software
cask "scapple"
# Word processing software with a typewriter style
cask "scrivener"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Notepad with a built-in calculator
cask "soulver"
# Open source cross-platform file explorer
cask "spacedrive"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Quicklook extension for source files
cask "syntax-highlight"
# Extract text from images and other digital documents
cask "textsniper"
# Web browser focusing on security
cask "tor-browser"
# Virtual machines UI using QEMU
cask "utm"
# Virtualization tool
cask "virtualbuddy"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi@snapshot"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard Mail", id: 6499493699
mas "Baking Soda", id: 1601151613
mas "Bluebird", id: 1478757472
mas "Codye", id: 1516894961
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
mas "egword Universal 2", id: 1272842196
mas "Expenses", id: 1492055171
mas "Final Cut Pro", id: 424389933
mas "FirstSeed Calendar", id: 1348617240
mas "FirstSeed Tasks", id: 1627018604
mas "Goodnotes", id: 1444383602
mas "HextEdit", id: 1557247094
mas "Hyperduck", id: 6444667067
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "LINE", id: 539883307
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Mercury", id: 1621800675
mas "Money Pro", id: 972572731
mas "Motion", id: 434290957
mas "NotesHub", id: 1621210753
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Orb", id: 6477840170
mas "Pages", id: 409201541
mas "Palworld", id: 6503918400
mas "Patterns", id: 429449079
mas "Perplexity", id: 6714467650
mas "Photomator", id: 1444636541
mas "Pieoneer", id: 6739781207
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "ProofreadAI", id: 6705131596
mas "QuickMIDI", id: 1459790045
mas "Raycast Companion", id: 6738274497
mas "RunCat", id: 1429033973
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "SnippetsLab", id: 1006087419
mas "stone", id: 1230288277
mas "Structured", id: 1499198946
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Transcribe", id: 1434184098
mas "Usage", id: 1561788435
mas "Velja", id: 1607635845
mas "Vinegar", id: 1591303229
mas "Yata", id: 1631370175
mas "Yoink", id: 457622435
mas "辞書 by 物書堂", id: 1380563956
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.amazon-q-vscode"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "cweijan.vscode-office"
vscode "dioxuslabs.dioxus"
vscode "docker.docker"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "johnnymorganz.stylua"
vscode "jrebocho.vscode-random"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "luizzak.swifttestfilegen"
vscode "mammothb.gnuplot"
vscode "marp-team.marp-vscode"
vscode "modular-mojotools.vscode-mojo"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oakessoftware.headers"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rooveterinaryinc.roo-cline"
vscode "shardulm94.trailing-spaces"
vscode "stripe.markdoc-language-support"
vscode "svelte.svelte-vscode"
vscode "sweetpad.sweetpad"
vscode "swiftlang.swift-vscode"
vscode "tauri-apps.tauri-vscode"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vknabel.vscode-apple-swift-format"
vscode "ziglang.vscode-zig"
