tap "alienator88/cask"
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "charmbracelet/tap"
tap "cirruslabs/cli"
tap "fsouza/prettierd"
tap "halqme/versions", "https://github.com/HALQME/homebrew-versions.git"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "humansignal/tap"
tap "jesseduffield/lazygit"
tap "k1low/tap"
tap "modularml/packages"
tap "mtgto/macskk"
tap "swiftwasm/tap"
tap "tk04/tap"
# Run your GitHub Actions locally
brew "act"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Download with resuming and segmented downloading
brew "aria2"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bash shell debugger
brew "bashdb"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Terminal multiplexer
brew "tmux"
# Text-based window manager and terminal multiplexer
brew "byobu"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Console Matrix
brew "cmatrix"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Command-line csv viewer
brew "csvlens"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# DVD-authoring toolset
brew "dvdauthor"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Cat alternative written in Go
brew "gat"
# R7RS Scheme implementation, developed to be a handy script interpreter
brew "gauche"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNOME text editor
brew "gedit"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU troff text-formatting system
brew "groff"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# LaTeX-to-HTML translator
brew "latex2html"
# Translate LaTeX to RTF
brew "latex2rtf"
# Compare and mark up LaTeX file differences
brew "latexdiff"
# Common error values for all GnuPG components
brew "libgpg-error"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# SIXEL encoder/decoder implementation
brew "libsixel"
# Linux virtual machines
brew "lima"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Zero-dependency real-time media server and media proxy
brew "mediamtx"
# Modern and intuitive terminal-based text editor
brew "micro"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Mac command-line tool that automatically downloads macOS Firmwares / Installers
brew "mist-cli"
# Cross platform, open source .NET development framework
brew "mono"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Platform built on V8 to build network applications
brew "node@22"
# Open source suite of directory software
brew "openldap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for the Pkl programming language
brew "pkl"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Prometheus SLO generator
brew "sloth"
# Ruby language server
brew "solargraph"
# Opinionated Lua code formatter
brew "stylua"
# Version control system designed to be a better CVS
brew "subversion"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Programmatically correct mistyped console commands
brew "thefuck"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# X.Org Applications: xauth
brew "xauth"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Suite of barcodes-reading tools
brew "zbar"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Packer
brew "hashicorp/tap/packer"
# Multi-type data labeling and annotation tool with standardized output format
brew "humansignal/tap/label-studio"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# tbls is a CI-Friendly tool for document a database, written in Go.
brew "k1low/tap/tbls"
# Modular developer CLI tool
brew "modularml/packages/modular"
# Watcher, bundler, and test runner for your SwiftWasm apps
brew "swiftwasm/tap/carton"
# Stand alone ad blocker
cask "adguard"
# VPN for privacy and security
cask "adguard-vpn"
# Note editor and whiteboard
cask "affine"
# Photo storage and sharing service
cask "amazon-photos"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tools for building Android applications
cask "android-studio"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Open-source project and knowledge management tool
cask "appflowy"
cask "aquaskk"
# Chromium based browser
cask "arc"
# Tool for digging into binary files
cask "archaeology"
# Asciidoc editor and toolchain to build books, documents and slides
cask "asciidocfx"
# Multi-track audio editor and recorder
cask "audacity"
# Audio player inspired by Winamp
cask "aural"
# Web browser focusing on privacy
cask "avast-secure-browser"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Edit and manage bibliographies
cask "bibdesk"
# Record and process your ideas
cask "bike"
# Desktop password and login vault
cask "bitwarden"
# Virtual Audio Driver
cask "blackhole-2ch"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# CD burning application
cask "burn"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Code editor
cask "codeedit"
# Multi-language programming editor
cask "coderunner"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Tool to run Windows software
cask "crossover"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# IDE for building React Native applications
cask "deco"
# Trains AIs to understand and translate texts
cask "deepl"
# Virtual monitor for screen sharing
cask "deskpad"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# NDI integration for OBS Studio
cask "distroav"
# Developer platform
cask "dotnet-sdk@8"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Share your work and ideas with video messages and screenshots
cask "dropbox-capture"
# Web browser focusing on privacy
cask "duckduckgo"
# Find files, folders, or contents in any file
cask "easyfind"
# Launcher for *Epic Games* games
cask "epic-games"
# Status monitoring
cask "eul"
# Collaborative team software
cask "figma"
# Network scanner
cask "fing"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox@developer-edition"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-0xproto-nerd-font"
cask "font-cascadia-mono-nf"
cask "font-hannari"
cask "font-jetbrains-mono-nerd-font"
cask "font-kiwi-maru"
cask "font-plemol-jp-nf"
cask "font-source-code-pro"
cask "font-yusei-magic"
# 3D parametric modeller
cask "freecad"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-beta"
# Client for the Google Drive storage service
cask "google-drive"
# Virtual globe
cask "google-earth-pro"
# Tools to protect your emails and files
cask "gpg-suite"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open Source Multimedia Framework
cask "gstreamer-development"
# Open Source Multimedia Framework
cask "gstreamer-framework"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Game launcher
cask "heroic"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# All-in-One Project Management Platform
cask "huly"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Hex editor for reverse engineers
cask "imhex"
# Menu bar calendar
cask "itsycal"
# Offline AI chat tool
cask "jan"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Find shortcuts for any installed application
cask "keyclu"
# GPU-based terminal emulator
cask "kitty"
# Data visualization and analysis software
cask "labplot"
# Open source code editor written in Rust
cask "lapce"
# NDI SDK
cask "libndi"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Collection of alternate languages for LibreOffice
cask "libreoffice-language-pack"
# Discover, download, and run local LLMs
cask "lm-studio"
# Support for Logitech G gear
cask "logitech-g-hub"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Yet Another macOS SKK Input Method
cask "macskk"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Speech recognition tool
cask "macwhisper"
# Desktop App for Easily Viewing and Editing Markdown Files
cask "marker"
# Extensible two-pane file manager
cask "marta"
# Code snippets manager for developers
cask "masscode"
# Text editor
cask "mi"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Open-source DJ software
cask "mixxx"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source download manager
cask "motrix"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Open-source music notation software
cask "musescore"
# Multi-file renaming tool
cask "name-mangler"
# Free and open-source RSS reader
cask "netnewswire"
# Remote desktop software
cask "nomachine"
# Handy utility to manage and customize the notch area
cask "notchnook"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Automated scene switcher for OBS Studio
cask "obs-advanced-scene-switcher"
# iOS camera plugin for OBS Studio
cask "obs-ios-camera-source"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama"
# Securely and anonymously share files, host websites, and chat with friends
cask "onionshare"
# Document editor
cask "onlyoffice"
# Web browser
cask "opera"
# Replacement for Docker Desktop
cask "orbstack"
# Mimic the aesthetic of ray-oscilloscopes
cask "oscilloscope"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Used to access context-specific actions when text is selected
cask "popclip"
# Collaborative SQL editor
cask "popsql"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# HTTP debugging proxy
cask "proxyman"
# Sound, video and lighting control
cask "qlab"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Spaced-repetition powered note-taking tool
cask "remnote"
# Data science software focusing on R and Python
cask "rstudio"
# Notepad software
cask "scapple"
# Word processing software with a typewriter style
cask "scrivener"
# Utility to control Gatekeeper via a GUI
cask "sentinel-app"
# MySQL/MariaDB database management
cask "sequel-ace"
# Screenshot measurement and annotation tool
cask "shottr"
# Web browser
cask "sigmaos"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Notepad with a built-in calculator
cask "soulver"
# Open source cross-platform file explorer
cask "spacedrive"
cask "sqlectron"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Interior design application
cask "sweet-home3d"
# Quicklook extension for source files
cask "syntax-highlight"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Customizable email client
cask "thunderbird"
# Menu bar app to show Time Machine information
cask "timemachinestatus"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Virtualiser for x86 hardware
cask "virtualbox"
# Virtualization tool
cask "virtualbuddy"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi-snapshot"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Wine wrapper built with SwiftUI
cask "whisky"
# Compatibility layer to run Windows applications
cask "wine-crossover"
# WordPress client
cask "wordpresscom"
# WordPress local development environment
cask "wordpresscom-studio"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Driver and configuration app for XP-Pen graphic tablets
cask "xppen-pentablet"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "astro-build.astro-vscode"
vscode "atommaterial.a-file-icon-vscode"
vscode "austenc.tailwind-docs"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dioxuslabs.dioxus"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jrebocho.vscode-random"
vscode "marp-team.marp-vscode"
vscode "mathematic.vscode-latex"
vscode "modular-mojotools.vscode-mojo"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sourcegraph.cody-ai"
vscode "sswg.swift-lang"
vscode "supabase.vscode-supabase-extension"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftformat"
vscode "ziglang.vscode-zig"
